
&НаКлиенте
Процедура Расчитать(Команда)
	Тариф = 0;
	Если КоличествоМестВВоздушномСудне<20 Тогда 
		
		Тариф = 10000000
		
	ИначеЕсли КоличествоМестВВоздушномСудне >= 20 и КоличествоМестВВоздушномСудне < 100 Тогда 
		
		Тариф = 30000000;
	ИначеЕсли КоличествоМестВВоздушномСудне >= 100 и КоличествоМестВВоздушномСудне < 200 Тогда
		
		Тариф = 50000000;
		
	Иначе 
		Тариф = 100000000;
		
	КонецЕсли;
	
	КВУ = 0;
	
	Если КоличествоЧасовНалета < 3000 Тогда 
		
		КВУ = 0.1;
	ИначеЕсли КоличествоЧасовНалета >= 3000 и КоличествоЧасовНалета < 10000 Тогда 
		
		КВУ = 0.5;
		
	Иначе 
		КВУ = 0.8;
	КонецЕсли;
	
	 КЭ = 0;
	 
	 Если КоличествоЧасовКВС < 3000 Тогда 
		 
		 КЭ = 2;
		 
	 ИначеЕсли КоличествоЧасовКВС >= 3000 и КоличествоЧасовКВС < 7000 Тогда 
		 
		 КЭ = 1.2;       
		 
	 ИначеЕсли КоличествоЧасовКВС >= 7000 и КоличествоЧасовКВС < 10000 Тогда
		 
		 КЭ = 0.8;
		 
		 Иначе КоличествоЧасовКВС = 10000  Тогда
		 
		 КЭ = 0.8;
		 
	 КонецЕсли;
	 
	 
	 КВГ = 0;
	 
	 Если СреднеГодовоеКоличествоРейсов < 100 Тогда 
		 
		 КВГ = 0.2;
		 
	 ИначеЕсли КоличествоЧасовКВС >= 100 и КоличествоЧасовКВС < 600 Тогда 
		 
		 КВГ = 0.9;     
		 
	 Иначе 
		  КВГ = 1.3;
		 
	  КонецЕсли; 
	  
	  
	   КППТО = 0;
	 
	 Если КоличествоМесяцевСПоследнегоТО < 12 Тогда 
		 
		 КППТО = 0.1;
		 
	 ИначеЕсли КоличествоМесяцевСПоследнегоТО >= 12 и КоличествоМесяцевСПоследнегоТО < 36 Тогда 
		 
		 КППТО = 0.5;     
		 
	 Иначе 
		  КППТО = 0.8;
		 
	 	 КонецЕсли;

  	КСС = 0;
	 
	 Если СрокСтрахованияВМесяцах = 3 Тогда 
		 
		 КСС = 0.4;
		 
	 ИначеЕсли СрокСтрахованияВМесяцах = 6  Тогда 
		 
		 КСС = 0.6; 
		 
		     ИначеЕсли СрокСтрахованияВМесяцах = 9  Тогда 
		 
		 КСС = 0.8;  
		 
	 ИначеЕсли СрокСтрахованияВМесяцах = 12  Тогда 
		 
		 КСС = 1;  
 
	 КонецЕсли;  
	 
	 СтраховаяПремия = Тариф * КВУ * КЭ* КВГ*КППТО*КСС;


	
КонецПроцедуры;
